Again, the module has nothing to do with it, I was editing the resource directly.

Anyway, here's a self-contained explicit exhaustive reproductive case. You'll only have to change the zone_id:

```tf
terraform {
  required_providers {
    cloudflare = {
      source = "cloudflare/cloudflare"
    }
  }
}

provider "cloudflare" {
}

resource "cloudflare_page_rule" "this" {
  target  = "whatever/*"
  zone_id = "82592f37298b1a37a3fb743431a53c1c"

  actions {
    cache_key_fields {
      query_string {
        exclude = ["api_token"]
      }
      user {
        lang = true
      }
      host {}
      cookie {}
    }
  }
}
```

Run `terraform apply`:
```
Terraform will perform the following actions:

  # cloudflare_page_rule.this will be created
  + resource "cloudflare_page_rule" "this" {
      + id       = (known after apply)
      + priority = 1
      + status   = "active"
      + target   = "whatever/*"
      + zone_id  = "82592f37298b1a37a3fb743431a53c1c"

      + actions {
          + always_use_https    = false
          + disable_apps        = false
          + disable_performance = false
          + disable_railgun     = false
          + disable_security    = false
          + disable_zaraz       = false

          + cache_key_fields {
              + cookie {
                  + check_presence = (known after apply)
                  + include        = (known after apply)
                }

              + host {
                  + resolved = false
                }

              + query_string {
                  + exclude = [
                      + "api_token",
                    ]
                  + ignore  = (known after apply)
                  + include = (known after apply)
                }

              + user {
                  + device_type = (known after apply)
                  + geo         = (known after apply)
                  + lang        = true
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_page_rule.this: Creating...
cloudflare_page_rule.this: Creation complete after 2s [id=11e475e98dd96670b35d3512adf0644c]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
Good.
Now run terraform apply again:
```
Terraform will perform the following actions:

  # cloudflare_page_rule.this will be updated in-place
  ~ resource "cloudflare_page_rule" "this" {
        id       = "11e475e98dd96670b35d3512adf0644c"
        # (4 unchanged attributes hidden)

      ~ actions {
            # (7 unchanged attributes hidden)

          ~ cache_key_fields {
              + cookie {
                  + check_presence = (known after apply)
                  + include        = (known after apply)
                }

                # (3 unchanged blocks hidden)
            }
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_page_rule.this: Modifying... [id=11e475e98dd96670b35d3512adf0644c]
cloudflare_page_rule.this: Modifications complete after 8s [id=11e475e98dd96670b35d3512adf0644c]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```
And again:
```
Terraform will perform the following actions:

  # cloudflare_page_rule.this will be updated in-place
  ~ resource "cloudflare_page_rule" "this" {
        id       = "11e475e98dd96670b35d3512adf0644c"
        # (4 unchanged attributes hidden)

      ~ actions {
            # (7 unchanged attributes hidden)

          ~ cache_key_fields {
              + cookie {
                  + check_presence = (known after apply)
                  + include        = (known after apply)
                }

                # (3 unchanged blocks hidden)
            }
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_page_rule.this: Modifying... [id=11e475e98dd96670b35d3512adf0644c]
cloudflare_page_rule.this: Modifications complete after 2s [id=11e475e98dd96670b35d3512adf0644c]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```
etc...

And yes if I don't specify any `cookie {}` I won't get the infinite drift, but as I can't make the block dynamic when we parametrize the resource, I have to state a `cookie {}` block, be it empty or not, and this leads to the infinite drifts.